Repository: mozilla-l10n/mt-training-data
Catalog: nyu/nyu_pontoon.tmx
Source language: en_us
Languages: nyu

source: Review and vote for new questions submitted by the community
nyu: Bwerezera na kusankhula mibvundzo ipsa yomwe idatumizidwa na mbumba za ncisa

source: Review could not be saved. Please try again later.
nyu: Kubwerezeriwa kungalekiwe kukoyiwa. Yezereni pomwe nthawe inango.

source: ⓘ Review Criteria
nyu: Masankhulidwe ya kubwerezera

source: Review Criteria
nyu: Masankhulidwe ya kubwerezera

source: Reviewed sentences not submitted, are sure?
nyu: Mifolo-fala yomwe yamala kubwerezeriwa irbe kutumiziwa, muna cadidi ?

source: Review existing sentences submitted by the community
nyu: Kubwereza mifolo-fala yomwe iripo kale yomwe idatumiziwa na anthu wa ncisa

source: Review questions
nyu: Kubwereza mibvundzo

source: Review & re-record clips here as you go
nyu: Bwerezera ndipo ucikoya fala nkaseti ya mifolo-fala uku muciyenderera.

source: Review & re-record clips if needed
nyu: UKu mukubwerezera, koyani pomwe mifolo-fala nkaseti mungakhala munfuna

source: Review sentences
nyu: Kubwerezera mifo-fala mubzilewedwe bzace

source: Review Sentences
nyu: Kubwerezera mifolo-fala

source: Review & Submit
nyu: Bwerezani ndipo mucitumiza

source: Review transcriptions of recorded sentences for accuracy
nyu: Kubwerezera mwa bwinobwino kwa manembo na mifolo-fala yomwe idakoyiwa nkaseti

source: Review user-submitted transcriptions in your language
nyu: Kubwerezera manembo yomwe adatumiziwa na anthu alewi wa ciledwe cawo.

source: s
nyu: g

source: S
nyu: P

source: Select an option
nyu: Sankhulani nsankhulo ubodzi

source: Select a variant (optional)
nyu: Sankhulani kalewedwe kabodzi ca cilewedwe (kufuna kwanu)

source: Select File
nyu: Sankhulani sagudhu ya mphangwa

source: Select File to Upload
nyu: Sankhulani thumba ibodzi ya mphangwa kuti mutumize

source: Select up to three domains (optional)
nyu: Sankhulani madziwikidwe ayayi mbali zitatu zomwe nfolo-fala uncita mbali

source: Sentence
nyu: Nfolo-fala

source: Sentence Domain
nyu: Madziwike ayayi mbali yomwe nfolo-fala uncita

source: Sentences contributed here will be added to a publicly available cc-0 licensed dataset.
nyu: Mifolo-fala yomwe mudanemba pano inayikhiwa mugulu ya mamphangwa yomwe alipo ndipo pinakhala padeca mu cc-0.

source: { $sentences } sentences reviewed. Thank you!
nyu: { $sentences } mifolo-fala ya bwerezeriwa. Ndatenda!

source: Sentence Variant
nyu: Mifolo-fala ya kusiyanasiyana

source: Separate sentences into one line by pressing “Enter” or “Return” once
nyu: Gawaniza mifolo-fala yomwe nja panthemba ubodzi ucitinya matobo “Enter” ayayi “Return” kabodzi basi

source: Service and Retail
nyu: Mabasa ya zamalonda

source: Share Common Voice
nyu: Kutumizira wa Common Voice

source: Share your clip
nyu: Tumizani kaseti yanu

source: Shortcuts
nyu: Athandizi twa matobo ya nchini wa ndzeru

source: [Should be ‘dinosaurs’]
nyu: [Tenki pawerengiwe ‘bzinyama’]

source: [Should be “We are”]
nyu: [Tenki werenga tere “ya madzi”]

source: Single
nyu: Nfolo-fala ubodzi

source: Single sentence submission
nyu: Kutumiziwa kwa nfolo-fala ubodzi

source: Skip
nyu: Kumoga

source: Small batch
nyu: Kagulu kang 'o ng'ono

source: Small batch sentence submission
nyu: Kutumiziwa kwa mifolo-fala kwa pang'o ng'ono

source: Source: { $sentenceSource }
nyu: Kwakubukira: { $sentenceSource }

source: Speak
nyu: Kulewalewa

source: Speak now
nyu: Lewa tsapano

source: Speak options menu
nyu: Kanyumba ka bzisankho ya fala

source: Start recording
nyu: Kuyamba kuyikha fala nkaseti

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
nyu: <strong>[Exitalo]</strong> bzinyama bzikulubzikulu bza <strong>[exitalo]</strong> -riyasiko.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
nyu: <strong>[Exipiro]</strong> Bzinyama bzikulubzikulu <strong>[cifuwa]</strong> Tiriyasiko.

source: Submit
nyu: Kutumiza

source: Submit a new question for the community to read and respond to
nyu: Kutumiza bvundzo upsa kwa wanthu wa ncisa kuti awerenge na kutawira

source: Submit a report
nyu: Kutumiza bzomwe bzidacitika

source: Submit clips
nyu: Kutumiza mifolo-fala

source: Submit new questions for the community to read and respond to
nyu: Kutumiza mibvundzi inango ayayi ipsa kuti wanthu wa ncisa awerenge na kutawira

source: Success
nyu: Bzabwino

source: success checkmark
nyu: Kusankhula kwa bwino mwakusaya kuneseka

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
nyu: Fambisani kumbali ya madidi kuti mubvumize miflo-fala. Fambisani kumbali ya madzere kuti mulambe. Fambisani kumbali ya kudzawulu kuti mumoge. <strong>Lekani kuyebwa kutumiza nyabwerezera wanu!</strong>

source: Taking several attempts to read a word.
nyu: Kuwerenga kwa kupitiriza kwa fala ibodzi

source: Tap
nyu: Khuya

source: Technology and Robotics
nyu: Tekinolojhiya na bzarebhoti

source: Thank you for contributing your bulk submission!
nyu: Ndatenda na kuthandiza kwa kutumiza kwa gulu ya mifolo-fala komwe mwacita!

source: Thank you for contributing your voice!
nyu: Ndatenda na cithandzizo comwe mwatipasa na fala yanu!

source: Thank you for donating your voice clips!
nyu: Ndatenda na kubvuma kwakukoyiwa kwa fala yanu nkaseti!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
nyu: Ndatenda na kukoya kwa mafala komwe mwacita!<lineBreak></lineBreak>Tsapano bwerezani na muciwatumiza.

source: Thank you for your voice information
nyu: Ndatenda na mphangwa zomwe mwatipasira na fala yanu.

source: The bumblebee sped by.
nyu: Nyuci zapita kankamangu.

source: The clip has disrespectful or offensive language.
nyu: Kasetiyi ikulewa bzinthu bzakuyipa ayayi bzakutukana.

source: The giant dinosaur of the Triassic.
nyu: Bzinyama bzikulubzikulu bza Tiriyasiko .

source: The giant dinosaurs of the Triassi-.
nyu: Bzinyama bzikulubzikulu bza Tiriyasi-.

source: The giant dinosaurs of the Triassic.
nyu: Bzinyama bzikulubzikulu bza Tiriyasiko .

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
nyu: Bzinyama bzikulubzikulu bza Tiriyasiko. <strong>[kuwerengiwa na muwira ubodzi]</strong>

source: The giant dinosaurs of the Triassic. Yes.
nyu: Bzinyama bzikulubzikulu bza Tiriyasiko, tenepayi.

source: The giant dino <strong>[cough]</strong> the Triassic.
nyu: Cinyama cikulu <strong>[cifuwa]</strong> ca Tiriyasiko.

source: There are currently no sentences to review in this language.
nyu: Mpaka pano, neye, palibe nfolo-fala yomwe unfunika kuti ubwerezeriwe pacilewedwe ici.

source: The recording was too long.
nyu: Kukoyiwa kwa fala mugwangwa kwakhala kwakuyenderera.

source: The recording was too quiet.
nyu: Kukoyiwa kwa fala mugwangwa kwakhala na volume ya kubwezeka.

source: The recording was too short.
nyu: Kukoyiwa kwa fala mugwangwa kwakhala kwakucepa.

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
nyu: Pana kusiyanasiyana kwa vulume kwa awerengi. Lambani volume lomwe ikukuwa kwenekwene yomwe ingacitise kuti kukoyiwa kwa fala kutazike ayayi (bzizinji) pangakhale volume ikukuwa lini kwenekwene, koma imwe mukukwanisa lini kubva bzomwe bzikuwerengiwa bzomwe bzidanembiwa patsamba.

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
nyu: Nyakulokota ayayi nyakusaka miflo-fala alikubwera kupalataforoma ya kuyamba ya Common Voice. Tsapano imwe munga <writeURL>kunebma</writeURL> nfolo-fala ubodzi ayayi<reviewURL>kubwerezera</reviewURL> kutumiza kwa nfolo-fala ubodzi kwa Common Voice.

source: The sentence has a grammatical or spelling error.
nyu: Nfolo-fala walembedwa mwakuphonyeka

source: The sentence has disrespectful or offensive language.
nyu: Nfolo-fala ngwakuyipa ayayi manewedwe yawene ndi yakupusa

source: The sentence must be grammatically correct.
nyu: Nfolo-fala utoweze mwa bwinobwino ntemo wa cilewedwe.

source: The sentence must be speakable.
nyu: Ukwanisiwe kuwerengiwa nfolo-falawo.

source: The sentence must be spelled correctly.
nyu: Nfolo-fola unembiwe mwa bwinobwino.

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
nyu: Kulewa kwa bzinthu ibzi penu mphangwa bzomwe munatipasa ndi kwakufuna kwanu. Imwe munalewa mungakhala mukufuna. Tingakhala tikufuna kumwaza mphwangwa ayayi bzinthu ibzi tisacita mwacintsinsi pambadziwika lini munthu omwe adalewa ndipo tisacita pomwe kuti dzina na email yanu ikhonde kudziwika na anthu na mphangwa zinango ninga magole antu na pinango ninga penu ndimwe nkazi ayayi mamuna.

source: Three to go!
nyu: Papitatu, ndokoni!

source: Too many files
nyu: Pana masagudhu ya mphangwa kwenekwene

source: Transcribe audio recordings
nyu: Kunemba bzomwe bzidalewedwa nkaseti mubzilewedwe bzace

source: Transcribe audio recordings into text
nyu: Kunemba bzomwe bzidalewedwa nkaseti kubzinemba patsamba

source: Try again by dragging your file here
nyu: Yezerani pomwe kufambisa sagudhu ya mphangwa zanu mpaka apa

source: Try uploading again
nyu: Yezerani kutumiza pomwe

source: Understand contribution criteria
nyu: Bvesesani masankhuliro ya muthandizi

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
nyu: Dziwa bzomwe unganyang-ane pakubva kaseti ya fala ndipo thandiza kuti pawoneke kukoyiwa kwa mafala ya bawino!

source: Upload aborted. Do you want to delete your recordings?
nyu: Kuyimisiwa kutumiza. Mukufuna kupfudza kaseti zanu?

source: { $uploadedSentences } of { $totalSentences } sentences collected
nyu: { $uploadedSentences } ya { $totalSentences } mifolo-fala yomwe idabweresiwa

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
nyu: { $uploadedSentences } de { $totalSentences } mifolo-fala yomwe idabweresiwa ayayi idayikhiwa. Tinya<downloadLink>apa</downloadLink> kuti ubuluse mifolo-fala yomwe iribe kubvumiziwa, yire yomwe idalambiwa.

source: Upload failed, please retry.
nyu: Kuphonyeka pakutumiza, yezerani pomwe nthawe inango.

source: Upload <icon></icon> public domain sentences
nyu: Kutumiza <icon></icon> Mifolo-fala ya kudziwika na anthu mbumba ayayi wanthu wense

source: Upload in progress...
nyu: Kutumiziwa kukucitika

source: Upload more sentences?
nyu: Kutumiziwa pomwe mifolo-fala?

source: Use correct grammar
nyu: Phatisa basa ntemo wa cilewedwe mwabino

source: Use correct spelling and punctuation
nyu: Phatisa basa kanembedwe ka cilewedwe mwa bwino na mathotho

source: Validate Readings
nyu: Kubvumiza mawerengedwe

source: Validate Readings, Review Transcriptions
nyu: Kubvumiza mawerengedwe, kubwerezera makaseti na manembo

source: Validate Readings <small>(Coming soon)</small>
nyu: Kubvimiza mawerengedwe <small>(tsapano)</small>

source: Validate readings submitted by community members
nyu: Kubvumiza mawerengo yomwe adatumiziwa na anthu wa mucisa.

source: Validate user-recorded readings in your language
nyu: Kubvumiza mawerengedwe yomwe adakoyiya mugwangwa ya fala, yomwe adakoyiwa na anthu alewi ya cilewedwe cawo

source: Varying Pronunciations
nyu: Malewedwe ya kusiyanasiyana

source: Volume
nyu: Vulume

source: Want to save your information? <createProfile>Create a profile</createProfile>
nyu: Mukufuna kukoya mphangwa zanu? <createProfile>Kondzani ayayi bzinembeseni dzina yanu</createProfile>

source: We are going out to get a coffee.
nyu: Bwereni ticoke kuti tikamwe xaya.

source: We are going out to get coffee.
nyu: Bwerani ticoke kuti tikamwe xaya.

source: We couldn’t get any audio clips for you to listen to. Please try again later.
nyu: Palibe kukwanisika kuti pawoneke kaseti ya mafala yomwe adakoyiwa kuti imwe mubve. Yezerani pomwe nthawe inango.

source: We couldn’t get any sentences for you to speak. Please try again later.
nyu: Palibe kukwanisika kuti pawoneke folo-fala. Yezerani pomwe nthawe inango.

source: We may have run out of clips - refresh the page, or try again later.
nyu: Ife tasala tiribe makaseti kuti tibvumize cilewdweci...

source: We’re going out to get coffee.
nyu: Ndikuyenda kamwa khapu y' madzi.

source: We're making some big changes
nyu: Tikucinja bzinthu bzikulu

source: We’re sorry, your platform is not currently supported.
nyu: Pepani, koma palataforoma yanu iliri lini bwino

source: We've run out of sentences to record in this language...
nyu: Ife tiribe pomwe mifolo-fala yomwe tingafune kuyikoya mugwangwa ya fala...

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
nyu: Tikufuna kuti malogaritimo ya upfundzi ya nchini ukwanise kuphata mabasa na kunyangula kwakusiyasiyana komwe kungawoneke. Kuwakuwa kwa bzinthu kungabvumidwe , pangakhala pakubveka piwomwe pidanembiwa patsamba. Nyimbo zomwe zingabveke kutalitali, zingabvumidwe. Nyimbo zomwe zingabveke mwakukuwa zomwe zingaphonyese kubviwa kwa fala, neye.

source: What issues are you experiencing with this sentence?
nyu: Ndi mabvuto aponi yomwe mukugumana nawo pa nfolo-fala uwu.

source: What needs to be in my file?
nyu: Piponi piwomwe pikufunika kuti ndikhale napiyo musagudhu ya mphangwa zangu?

source: What sentences can I add?
nyu: Ndi mifolo-fala iponi yomwe ndinganembe ?

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
nyu: Pakubva, wonesa mwabwino bzomwe bzayikhiwa nkaseti na pire piwomwe pidanembiwa; siya ungawona kuphonyeka pang-ono <br /> kuphonyeka kuzinji ndi uku:

source: Why are you asking?
nyu: Thangweranji mukubvundza ?

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
nyu: Bzinembeseni dzina lanu imwe mungawone mabasa yanu na kuphatana na ncisa mwanu na ale womwe ambatithandiza na mafala yawo.

source: Write
nyu: Kunemba

source: Write options menu
nyu: Kanyumba ka pisankho piyakunemba

source: y
nyu: s

source: Y
nyu: S

source: Yes
nyu: Inde

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
nyu: Imwe mungaphatise basa athandizi wa matobo ya nchini wa ndzeru: { sc-review-form-button-approve-shortcut } kuti mubvumize, { sc-review-form-button-reject-shortcut } kuti mulambe, { sc-review-form-button-skip-shortcut } kuti mumoge

source: You cannot add multiple sentences for a single submission
nyu: Imwe lekani kuyikha mifolo-fala ya kusiyanasiyana pantumizo ubodzi

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
nyu: Imwe mukanati kusankhula cilewedwe. Ndokoni uku <profileLink>Dzina</profileLink> kuti musankhule bzilewedwe.

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
nyu: Imwe mwamaliza nthawe ya kutumiza apa. Dikirirani mphindi { $retryLimit } pomwe mukanati kutumiza mifolo-fala inango. Ndatenda na kudikirira kwanu komwe mwacita!

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
nyu: Imwe mwamaliza nthawe ya kutumiza apa. Dikirirani kamphindi/segundo { $retryLimit } pomwe mukanati kutumiza mifolo-fala inango. Ndatenda na kudikirira kwanu komwe mwacita!

source: You must allow microphone access.
nyu: Imwe tenki kusiya mikorofoni kuti iphate basa.

source: You’re contributing to a target segment
nyu: Imwe mukuthandiza mabasa yathu ya kufunika

source: You’re contributing to our first target segment
nyu: Imwe mukuthandiza mabasa athu akutoma yomwe njakufunika

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
nyu: Imwe mukuyenda mwakuthamanga kwenekwene. Sakani na cheru kuti mubwerezere mwa bwinobwino mwakusaya kuthamanga.

source: You're helping Common Voice reach our daily sentence goals!
nyu: Imwe mwathandiza wa Common Voice kukwanisa kumaliza kuphata mabasa yawo ya pantsiku yomwe nja kukondza na kutumiza mifolo-fala!

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
nyu: Cilewedwe canu ciripo pa mifolo-falayi! Ngati imwe mungabzibva bwino, cinjani kuti muwone mifolo-fala inango ya cilewedwe canu.

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
nyu: Cilewedwe canu ciripo pa mifolo-falayi! Ngati imwe mungabzibva bwino, cinjani kuti muwone mifolo-fala inango ya cilewedwe canu.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
nyu: Imwe mwathandiza wa Common Voice kukwanisa <goalPercentage></goalPercentage> kumaliza mabasa yawo ya pantsiku { $goalValue } yomwe nja kukoya mafala mugwanga ya fala ayayi nkaseti!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
nyu: Imwe mwathandiza wa Common Voice kukwananisa<goalPercentage></goalPercentage> kumaliza mabasa yawo ya pantsiku { $goalValue } yomwe nja kubvumiza mifilo-fala!
